import psycopg2

# Замените значения на свои настройки базы данных
db_settings = {
    'dbname': 'data_gdp_labor',
    'user': 'postgres',
    'password': '',
    # 'host': 'localhost',
    # 'port': '5432'
}

create_topics_table = """
CREATE TABLE topics (
    id SERIAL PRIMARY KEY,
    name VARCHAR(200) COLLATE "C" NOT NULL
);
"""

create_economic_indices_table = """
CREATE TABLE economic_indices (
    id SERIAL PRIMARY KEY,
    name VARCHAR(200) COLLATE "C" NOT NULL,
    link VARCHAR(200) NOT NULL,
    macro_id INT REFERENCES topics(id) ON DELETE CASCADE
);
"""

content_data = [
    ("Макроэкономика"),
    ("Рынок труда"),
    ("Предпринимательство"),
    ("Регионы"),
    ("Зеленая Экономика"),
    ("Национальный план развития Республики Казахстан"),
    ("Национальные проекты"),
    ("Международные рейтинги"),
]

indicators_data = [
    ("Валовый внутренний продукт (ВВП)", "Link 1", 1),
    ("Индекс физического объема (ИФО)", "Link 2", 1),
    ("Производительность труда", "Link 3", 1),
    ("Инвестиции в основной капитал ", "Link 4", 1),
    ("Занятость, безработица, средняя зарплата по основным странам", "Link 5", 1),
    ("Индекс потребительских цен и индекс цен производителей", "Link 6", 1),
    ("Индекс цен на социально-значимые потребительские товары", "Link 7", 1),
    ("Индекс потребительских цен по странам", "Link 8", 1),
    ("Международные резервы и курсы валют", "Link 9", 1),
    ("Госдолг в % к ВВП по странам", "Link 10", 1),
    ("Кредитный рейтинг", "Link 11", 1),
    ("Исполнение государственного/ республиканского бюджета (доходы)", "Link 12", 1),
    ("Исполнение государственного/ республиканского бюджета (затраты)", "Link 13", 1),
    ("Индекс PMI по странам", "Link 14", 1),
    ("Торговый оборот Республики Казахстан", "Link 15", 1),
    ("Экспорт/импорт Республики Казахстан в разрезе стран", "Link 16", 1),
    ("Основные экспортные/импортные  товары", "Link 17", 1),
    ("Структура внешней торговли Республики Казахстан", "Link 18", 1),
    ("Основные экспортные несырьевые товары", "Link 19", 1),
    ("Прогноз социально-экономического развития", "Link 20", 1),
    ("Прогноз Института экономических исследований", "Link 21", 1),
    ("Консенсус прогноз", "Link 22", 1),
    ("Статистика труда", "Link 23", 2),
    ("Среднемесячная номинальная заработная плата по ВЭД", "Link 24", 2),
    ("Индекс номинальной заработной платы по ВЭД", "Link 25", 2),
    ("Индекс реальной заработной платы по ВЭД", "Link 26", 2),
    ("Среднемесячная номинальная заработная плата в разрезе регионов", "Link 27", 2),
    ("Индекс номинальной/реальной заработной платы в разрезе регионов", "Link 28", 2),
    ("Среднедушевые номинальные денежные доходы населения", "Link 29", 2),
    ("Индекс номинальных/реальных денежных доходов в разрезе регионов", "Link 30", 2),
    ("Доля населения, имеющего доходы ниже величины прожиточного минимума", "Link 31", 2),
    ("Общие показатели", "Link 32", 3),
    ("Отраслевая специализация субъектов МСП", "Link 33", 3),
    ("Валовый региональный продукт и индекс физического объема", "Link 34", 4),
    ("Валовый региональный продукт на душу населения", "Link 35", 4),
    ("Валовый выпуск продукции (услуг) сельского, лесного и рыбного хозяйства", "Link 36", 4),
    ("Объемы промышленного производства", "Link 37", 4),
    ("Численность населения Республики Казахстан", "Link 38", 4),
    ("Численность населения на начало года", "Link 39", 4),
    ("Численность населения на начало года", "Link 40", 4),
    ("Основные показатели в сфере низкоуглеродного развития и окружающей среды", "Link 41", 5),
    ("Объемы выбросов парниковых газов по странам", "Link 42", 5),
    ("Справедливая социальная политика", "Link 43", 6),
    ("Качественное образование", "Link 44", 6),
    ("Доступная и эффективная система здравоохранения", "Link 45", 6),
    ("Справедливое и эффективное государство на защите интересов граждан", "Link 46", 6),
    ("Новая модель государственного управления", "Link 47", 6),
    ("Культивирование ценностей патриотизма", "Link 48", 6),
    ("Укрепление национальной безопасности", "Link 49", 6),
    ("Построение диверсифицированной и инновационной экономики", "Link 50", 6),
    ("Активное развитие экономической и торговой дипломатии", "Link 51", 6),
    ("Сбалансированное территориальное развитие", "Link 52", 6),
    ("Устойчивый экономический рост, направленный на повышение благосостояния казахстанцев", "Link 53", 7),
    ("По развитию предпринимательства", "Link 54", 7),
    ("Сильные регионы - драйвер развития страны", "Link 55", 7),
    ('Ход реализации проекта "Ауыл - Ел бесігі"', "Link 56", 7),
    ('Информация о специалистах. получивших бюджетный кредит на приобретение жилья в рамках Проекта "С дипломом в село"', "Link 57", 7),
    ('Информация о специалистах. получивших подъемное пособие в рамках проекта "С дипломом в село"', "Link 58", 7),
    ("Международные рейтинги", "Link 59", 8),
]


def main():

    try:
        conn = psycopg2.connect(**db_settings)
        cur = conn.cursor()

        cur.execute(create_topics_table)
        cur.execute(create_economic_indices_table)

        # Вставка данных в ContentName
        for data in content_data:
            cur.execute(
                "INSERT INTO topics (name) VALUES (UPPER(%s))", (data,))

        # Вставка данных в IndicatorsName
        for data in indicators_data:
            cur.execute(
                "INSERT INTO economic_indices (name, link, macro_id) VALUES (UPPER(%s), %s, %s)", data)

        conn.commit()
    except psycopg2.Error as e:
        print("Error:", e)
    finally:
        if cur:
            cur.close()
        if conn:
            conn.close()


if __name__ == "__main__":
    main()
